Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_10_Design verification  _10 KONSTRUKTSIOONIOMADUSTE KONTROLL.tmx
Source language: en
Languages: et

source: g) Conductors carrying currents in excess of 200 A and the adjacent structural parts are so arranged that eddy-current and hysteresis losses are minimized.
et: g) Juhid, milles kulgevad voolud üle 200 A, ja naabruses paiknevad tariosad on selliselt korraldatud, et pöörisvoolud ja hüstereesikaod on minimeeritud.

source: The effective power losses of all circuits including interconnecting conductors shall be calculated assuming the circuits are operating at their group rated current, Ing.
et: Kõigi ahelate, sealhulgas vastastikuste ühendusjuhtide tegelikud võimsuskaod tuleb arvutada eeldusel, et ahelad talitlevad oma rühmtunnusvoolul Ing.

source: The total power loss of the assembly is calculated by adding the power losses of the circuits taking additionally into account that the total load current is limited to the rated current of the assembly, InA.
et: Kooste kogu võimsuskadu arvutatakse ahelate võimsuskadude liitmise teel, võttes lisaks arvesse, et kogu-koormusvool on piiratud kooste tunnusvooluga InA.

source: The power losses of the conductors are determined by calculation (see Annex H and Annex K).
et: Juhtide võimsuskaod tuleb määrata arvutuse teel (vt lisad H ja K).

source: NOTE 5 There are devices where the power loss is substantially proportional to I2 and others that have substantially fixed losses, e.g. variable speed drive.
et: MÄRKUS 5 On olemas seadiseid, mille võimsuskadu on sisuliselt võrdeline voolu ruuduga I2, ja muid, mille võimsuskaod on sisuliselt konstantsed, nt muutuva kiirusega ajamid.

source: EXAMPLE A single compartment assembly with a rated current InA of 100 A (limited by the distribution busbars) is equipped with 20 outgoing circuits.
et: NÄIDE Ühesektsioonilises koostes tunnusvooluga InA = 100 A (mis on piiratud jaotuslattide tõttu) on 20 väljuvat ahelat.

source: The assumed group rated current Ing for each circuit is 8 A.
et: Iga ahela eeldatav rühmtunnusvool Ing on 8 A.

source: The total effective power loss should be calculated for 12 outgoing circuits loaded with 8 A each.
et: Kogu tegelik võimsuskadu tuleb arvutada 12 väljuva ahela kohta, millest igaüks on koormatud vooluga 8 A.

source: 10.10.4.2 Single compartment assembly with natural cooling and rated current (InA) not exceeding 630 A 10.10.4.2.1 Verification method Verification of the temperature-rise may be made by calculation if all the general conditions listed in 10.10.4.1 are fulfilled, and using the following:
et: 10.10.4.2 Ühelahtriline loomuliku jahutusega kooste tunnusvooluga (InA) mitte üle 630 A 10.10.4.2.1 Kontrollimeetod Ületemperatuuri kontrolli võib sooritada arvutuse teel, kui kõik jaotises 10.10.4.1 nimetatud üldtingimused on täidetud, arvestades seejuures alljärgnevaid asjaolusid.

source: a) The air temperature-rise within the enclosure at a given power loss in the enclosure, for the applicable installation method being considered (e.g. flush mounting, surface mounting) is: – available from the enclosure manufacturer, or – determined in accordance with 10.10.4.2.2.
et: a) Õhu ületemperatuur ümbrises ümbrise antud võimsuskao korral, arvestades rakendatavat paigaldusviisi (nt süvistatud paigaldus, pinnapealne paigaldus), on — saadaval ümbrise tootjalt või — määratav vastavalt jaotisele 10.10.4.2.2.

source: b) The total power loss within the enclosure is calculated as detailed in 10.10.4.1.
et: b) Kogu võimsuskadu ümbrises on arvutatud, nagu üksikasjalikult esitatud jaotises 10.10.4.1.

source: The maximum permissible air temperature-rise within the enclosure is determined by the device with the lowest maximum operating air temperature and is taken as the maximum operating temperature of that device minus the daily average ambient air temperature (outside the enclosure).
et: Enimalt lubatav õhu ületemperatuur ümbrises on määratud seadisega, mille kõrgeim talitluslik õhutemperatuur on võrreldes muude seadistega madalaim ja võetakse kui selle seadise kõrgeim talitluslik õhutemperatuur miinus ööpäeva keskmine ümbritseva õhu temperatuur (väljaspool ümbrist).

source: When electronic devices with integral forced ventilation are incorporated, the enclosure shall be considered as having no natural ventilation, irrespective of whether or not openings exist in the enclosure.
et: Kui on sisse ehitatud elektroonikaseadmeid integraalse tugevdatud ventilatsiooniga, tuleb ümbris arvestada nagu ilma loomuliku ventilatsioonita, sõltumata sellest, kas ümbrisel on avasid või mitte.

source: 10.10.4.2.2 Determination of the power loss capability of an enclosure by test The power loss shall be simulated by means of heating resistors that produce heat equivalent to the intended power loss capability of the enclosure.
et: 10.10.4.2.2 Ümbrise talutava võimsuskao määramine katsetuse teel Võimsuskadu tuleb imiteerida küttetakistitega, mis eraldavad ümbrisele ette nähtud talutava võimsuskaoga võrdsel hulgal soojust.

source: The heating resistors shall be distributed evenly over the height of the enclosure and installed in suitable places inside the enclosure.
et: Küttetakistid tuleb ümbrises jaotada ühtlaselt kogu kõrguse ulatuses ja paigaldada sobivatesse kohtadesse ümbrise sees.

source: The cross-section of the leads to these resistors shall be such that no appreciable amount of heat is conducted away from the enclosure.
et: Nende takistite toitejuhtide ristlõige peab olema selline, et nende kaudu ei juhitaks märgatavalt soojust ümbrisest välja.

source: The test shall be carried out in accordance with 10.10.2.3.1 to 10.10.2.3.4 and the air temperature-rise shall be measured in the top of the enclosure.
et: Katsetus tuleb sooritada jaotiste 10.10.2.3.1 kuni 10.10.2.3.4 kohaselt, kusjuures õhu ületemperatuuri tuleb mõõta ümbrise ülaosas.

source: Enclosure temperatures shall not exceed the values given in Table 6.
et: Ümbrise temperatuur ei tohi ületada tabelis 6 esitatud väärtusi.

source: 10.10.4.2.3 Results to be obtained The assembly is verified if: – the enclosure is capable of dissipating power losses equal to or greater than those generated by the assembly at the maximum permissible air temperature-rise within the enclosure; – all conductors within the assembly have been selected to operate at the maximum permitted air temperature within the assembly.
et: 10.10.4.2.3 Saavutamist vajavad tulemused Kooste on kontrollitud, kui — ümbris on suuteline hajutama võimsuskadusid, mis on samasugused või suuremad kui need, mis on koostes kõrgeimal lubataval õhu ületemperatuuril ümbrise sees tekitatud; — kõik juhid koostes on valitud talitluseks kõrgeimal lubataval õhutemperatuuril kooste sees.

source: 10.10.4.3 Assembly with natural cooling and rated current (InA) not exceeding 1 600 A 10.10.4.3.1 Verification method Verification of the temperature-rise may be made by calculation in accordance with the method of IEC TR 60890:2014 providing the additional requirements of 10.10.4.1 are fulfilled.
et: 10.10.4.3 Loomuliku jahutusega kooste tunnusvooluga (InA) mitte üle 1600 A 10.10.4.3.1 Kontrollimeetod Ületemperatuuri kontrolli võib sooritada arvutuse teel dokumendis IEC TR 60890:2014 esitatud meetodi järgi, tagades, et jaotises 10.10.4.1 esitatud lisanõuded on täidetud.

source: The air temperature-rise within the assembly is then determined from the total power loss using the method of IEC TR 60890:2014.
et: Õhu ületemperatuur koostes on seejärel määratud kogu võimsuskao järgi, kasutades dokumendis IEC TR 60890:2014 esitatud meetodit.

source: The air temperature within the assembly is calculated by adding this air temperature-rise and the daily average ambient air temperature of the assembly.
et: Õhu temperatuur koostes arvutatakse nimetatud ületemperatuuri ja ööpäeva keskmise koostet ümbritseva õhu temperatuuri liitmise teel.

source: NOTE Natural ventilation is by means of air flow into and out of the enclosure without forced ventilation.
et: MÄRKUS Loomulik ventilatsioon seisneb õhu voolus ümbrisesse ja ümbrisest välja ilma sundventilatsioonita.

source: 10.10.4.3.2 Results to be obtained The assembly is verified if the calculated air temperature at the mounting height of any built-in component (devices, conductors, etc.) does not exceed the permissible operating air temperatures of the built-in components as declared by their manufacturers. 10.11 Short-circuit withstand strength 10.11.1 General The short-circuit current ratings declared shall be verified except where exempt, see 10.11.2.
et: 10.10.4.3.2 Saavutamist vajavad tulemused Kooste on kontrollitud, kui arvutatud õhutemperatuur mingi sisseehitatud komponendi (seadised, juhid jne) monteerimiskõrgusel ei ole kõrgem kui sisseehitatud komponentide puhul lubatav õhu talitlustemperatuur, nagu selle on deklareerinud nende tootjad.

source: Verification may be made by comparison with a reference design(s) (10.11.3 and 10.11.4) or by testing (10.11.5). For verification, the following apply.
et: 10.11 Lühisetaluvus 10.11.1 Üldnõuded Tuleb kontrollida deklareeritud lühisetaluvuse tunnusandmeid, välja arvatud juhul, mil seda ei nõuta (vt jaotis 10.11.2).

source: a) If the assembly system to be verified comprises a number of variants, the most onerous arrangement(s) of the assembly shall be selected, taking into account the rules in 10.11.3 and 10.11.4.
et: Kontrolli võib sooritada kas etalonkonstruktsiooni(de)ga võrdlemise teel (jaotised 10.11.3 ja 10.11.4) või katsetamisega (jaotis 10.11.5).

source: b) The assembly variants selected for test shall be verified according to 10.11.5.
et: Kontrollimisel kehtivad järgmised reeglid: a) kui kontrollitaval koostesüsteemil on palju variante, tuleb kontrollimiseks valida kooste kõige koormatum variant (kõige koormatumad variandid), arvestades jaotiste 10.11.3 ja 10.11.4 reegleid; b) katsetamiseks valitud koostevariante tuleb kontrollida vastavalt jaotisele 10.11.5;

source: c) When the assemblies tested are the most onerous variants of the larger product range of an assembly system, then the test results can be used to establish the ratings of similar variants without further testing.
et: c) kui katsetatud koosted on koostesüsteemi suurema tootesarja kõige koormatumad variandid, saab katsetuste tulemusi ilma edasiste katsetusteta kasutada muude taoliste variantide tunnusandmete kehtestamiseks.

source: Rules for such derivations are given in 10.11.3 and 10.11.4.
et: Sellekohased tuletusreeglid on esitatud jaotistes 10.11.3 ja 10.11.4.

source: 10.11.2 Circuits of assemblies which are exempted from the verification of the shortcircuit withstand strength A verification of the short-circuit withstand strength is not required for the following: a) assemblies having a rated short-time withstand current (see 5.3.5) or rated conditional short-circuit current (see 5.3.6) not exceeding 10 kA RMS for AC and 10 kA mean average for DC; b) assemblies, or circuits of assemblies, protected by current-limiting devices having a cut-off current not exceeding 17 kA with the maximum allowable prospective short-circuit current at the terminals of the incoming circuit of the assembly; c) auxiliary circuits of assemblies intended to be connected to transformers whose rated power does not exceed 10 kVA for a rated secondary voltage of not less than 110 V, or 1,6 kVA for a rated secondary voltage less than 110 V, and whose short-circuit impedance is not less than 4 %; d) circuits protected by frequency converters where the outputs are provided with electronic short-circuit protection that limits the cut-off current to not more than 17 kA, as declared by the manufacturer.
et: 10.11.2 Koostete ahelad, mis ei vaja lühisetaluvuse kontrolli Lühisetaluvuse kontrolli ei nõuta järgmistel juhtudel: a) kooste tunnus-lööktaluvusvoolu (vt jaotis 5.3.5) või tingliku tunnus-lühisvoolu (vt jaotis 5.3.6) efektiivväärtus ei ole vahelduvvoolul üle 10 kA ega keskväärtus alalisvoolul üle 10 kA; b) koosted või kooste ahelad on kaitstud voolupiiravate aparaatidega, mille läbilaskevool kooste sisendahela klemmidel suurima lubatava arvutusliku lühisvoolu korral ei ole üle 17 kA; c) koostete abiahelad on ette nähtud ühendamiseks trafodega, mille nimivõimsus sekundaarpinge nimiväärtusel 110 V või enam ei ole üle 10 kVA, sekundaarpinge nimiväärtustel alla 110 V aga mitte üle 1,6 kVA ning mille suhteline nimilühispinge ei ole alla 4 %; d) ahelad, mis on kaitstud sagedusmuunduritega, mille väljundis on ette nähtud elektrooniline lühisekaitse, mis piirab lõikevoolu mitte kõrgemale kui 17 kA, nagu selle on deklareerinud tootja.

source: All other circuits shall be verified.
et: Kõiki muid ahelaid tuleb kontrollida.

source: 10.11.3 Verification by comparison with a reference design – Using a checklist The verifications are undertaken by comparison of the assembly to be verified with a reference design(s) using the checklist provided in Table 13.
et: 10.11.3 Kontroll etalonkonstruktsiooniga võrdlemise teel – kontrollilehe kasutamine Kontroll toimub kontrollitava kooste ja etalonkonstruktsiooni(de) võrdlemise teel, kasutades selleks tabelis 13 esitatud kontrollilehte.

source: Should any elements identified in the checklist not comply with the requirements of the checklist and be marked ‘NO’, one of the following means of verification shall be used (see 10.11.4 and 10.11.5).
et: Kui mõni kontrollilehel loetletud elementidest ei vasta esitatud nõuetele (vastus „EI“), tuleb rakendada mõnda allpool kirjeldatud kontrolliviisi (vt jaotised 10.11.4 ja 10.11.5).

source: A fuse link used in the reference design can be replaced by a fuse link of another make or series without any further testing if: – the rating of the fuse links shall be the same; – the utilization category is the same (e.g. gG); – the fuse system is the same (e.g. NH); and – power loss is the same or lower.
et: Etalonkonstruktsioonis kasutatud sulari võib asendada muu sulavkaitsmega või muusse sarja kuuluva sulariga ilma edasise katsetamiseta, kui — sulari tunnusandmed on samasugused, — kasutuskategooria on sama (nt gG), — kaitsmesüsteem on sama (nt NH) ja — võimsuskadu on sama või väiksem.

source: 10.11.4 Verification by comparison with a reference design(s) – Using calculation Assessment of the rated short-time withstand current of an assembly and its circuits, by calculation, shall be undertaken by a comparison of the assembly to be assessed with an assembly already verified by testing.
et: 10.11.4 Kontroll etalonkonstruktsiooni(de)ga võrdlemise teel – arvutuse kasutamine Kooste ja selle ahelate lühiajalise tunnus-taluvusvoolu hindamine arvutuste teel tuleb sooritada hinnatava kooste ja varem juba katsetamise teel kontrollitud kooste võrdlemisega.

source: The assessment to verify the main circuits of an assembly shall be in accordance with Annex M. In addition, each of the circuits of the assembly to be assessed shall meet the requirements of items 6, 8, 9 and 10 in Table 13.
et: Kooste peaahelate kontrollhindamine peab toimuma lisa M kohaselt. Lisaks peavad hinnatava kooste kõik ahelad rahuldama tabeli 13 punktide 6, 8, 9 ja 10 nõudeid.

source: The data used, calculations made and the comparison undertaken shall be stated in the verification documentation.
et: Kasutatud andmed, sooritatud arvutused ja ettevõetud võrdlused tuleb esitada kontrollidokumentatsioonis.

source: If the assessment in accordance with Annex M does not pass or any of the items listed above are not fulfilled, then the assembly and its circuits shall be verified by test in accordance with 10.11.5.
et: Kui hindamine vastavalt lisale M ei anna tulemust või kui mõni eespool loetletud tingimustest ei ole täidetud, tuleb koostet ja selle ahelaid kontrollida katsetusega vastavalt jaotisele 10.11.5.

source: 10.11.5 Verification by test 10.11.5.1 Test arrangements The assembly or its parts as necessary to complete the test shall be mounted as in normal use.
et: 10.11.5 Kontroll katsetamise teel 10.11.5.1 Katsetuse korraldamine Kooste või selle osad, nagu see on täielikuks katsetamiseks vajalik, tuleb kohale paigutada nagu normaalkasutuseks.

source: It is sufficient to test a single functional unit if the remaining functional units are of the same construction.
et: Kui funktsionaalühikud on ühesuguse konstruktsiooniga, piisab ühe funktsionaalühiku katsetamisest.

source: Similarly, it is sufficient to test a single busbar configuration if the remaining busbar configurations are of the same construction.
et: Samuti piisab ühe komplekti kogumislattide katsetamisest, kui ülejäänud kogumislatid on samasuguse konstruktsiooniga.

source: Table 13 provides clarification on items not requiring additional tests.
et: Selgitused lisakatsetusi mittenõudvate elementide kohta on esitatud tabelis 13.

source: 10.11.5.2 Performance of the test If the test circuit incorporates fuses, fuse-links with the maximum let-through current and, if required, of the type indicated by the original manufacturer as being acceptable, shall be used.
et: 10.11.5.2 Katsetuse sooritamine Kui katsetusahel sisaldab sulavkaitsmeid, tuleb kasutada maksimaalse läbilaskevooluga ja, kui nõutakse, esmatootja poolt vastuvõetavaks tunnistatud sulareid.

source: The supply conductors and the short-circuit connections required for testing the assembly shall have sufficient strength to withstand short-circuits and be so arranged that they do not introduce any additional stresses on the assembly.
et: Kooste katsetamiseks nõutavad toitejuhid ja lühistamisühendused peavad olema piisava lühisetaluvusega ja need tuleb korraldada selliselt, et need ei avaldaks koostele koormavat lisatoimet.

source: Unless otherwise agreed, the test circuit shall be connected to the input terminals of the assembly.
et: Kui pole teisiti kokku lepitud, tuleb katsetusahel ühendada kooste sisendklemmidega.

source: Three-phase assemblies shall be connected on a three-phase basis.
et: Kolmefaasilised koosted tuleb ühendada kolmefaasilises süsteemis.

source: All parts of the equipment intended to be connected to the protective conductor in service, including the enclosure, shall be connected as follows: a) for assemblies suitable for use on three-phase four-wire systems with an earthed star point and marked accordingly, to the neutral point of supply or to a substantially inductive artificial neutral permitting a prospective fault current of at least 1 500 A; b) for assemblies also suitable for use in three-phase three-wire as well as on three-phase four-wire systems and marked accordingly, to the line conductor least likely to arc to earth.
et: Kõik talitluses kaitsejuhiga ühendamiseks ette nähtud seadmete osad, sealhulgas ümbris, peavad olema ühendatud järgmiselt: a) koostete puhul, mis sobivad kasutamiseks kolmefaasilistes neljajuhilistes maandatud tähtpunktiga süsteemides ja on sellekohaselt märgistatud – toiteahela neutraalpunktiga või sisuliselt induktiivse tehisneutraaliga, mis võimaldab arvutuslikku rikkevoolu vähemalt 1500 A; b) koostete puhul, mis samuti sobivad kasutamiseks kolmefaasilistes nii kolme- kui ka neljajuhilistes süsteemides ja on sellekohaselt märgistatud – faasijuhiga, mille maaühenduskaare tekke tõenäosus on kõige väiksem.

source: Except for assemblies according to 8.4.4, the connection mentioned in a) and b) shall include a fusible element consisting of a copper wire of 0,8 mm diameter and at least 50 mm long, or of an equivalent fusible element for the detection of a fault current.
et: Väljaarvatult jaotisele 8.4.4 vastavad koosted, peab punktides a ja b kirjeldatud ühendus sisaldama rikkevoolu tuvastamiseks sulavelementi, mis koosneb 0,8 mm läbimõõduga ja vähemalt 50 mm pikkusest vasktraadist, või muud samaväärset sulavelementi.

source: The prospective fault current in the fusible element circuit shall be 1 500 A ± 150 A, except as stated in Notes 2 and 3.
et: Arvutuslik rikkevool sulavelemendi ahelas peab olema 1500 A ± 150 A, väljaarvatult märkustes 2 ja 3 kirjeldatud juhtumitel.

source: If necessary, a resistor limiting the current to that value shall be used.
et: Vajaduse korral tuleb kasutada voolu etteantud väärtuseni piiravat takistit.

source: NOTE 1 A copper wire of 0,8 mm diameter will melt at 1 500 A in approximately half a cycle at a frequency between 45 Hz and 67 Hz (or 0,01 s for DC).
et: MÄRKUS 1 Vasktraat läbimõõduga 0,8 mm sulab voolu 1500 A korral ligikaudu ühe poolperioodi jooksul, kui sagedus on vahemikus 45 Hz kuni 67 Hz (või alalisvoolu puhul 0,01 s jooksul).

source: NOTE 2 The prospective fault current can be less than 1 500 A in the case of small equipment, according to the requirements of the relevant product standard, with a smaller diameter copper wire (see Note 4) corresponding to the same melting time as in Note 1.
et: MÄRKUS 2 Arvutuslik rikkevool võib väikeste seadmete puhul olla alla 1500 A. Vastavalt asjakohase tootestandardi nõuetele kasutatakse väiksema läbimõõduga vasktraati (vt märkus 4), mille sulamisaeg on sama nagu märkuses 1.

source: NOTE 3 In the case of a supply having an artificial neutral, a lower prospective fault current can be accepted, subject to the agreement of the assembly manufacturer, with a smaller diameter copper wire (see Note 4) corresponding to the same melting time as in Note 1.
et: MÄRKUS 3 Kui toiteahelas kasutatakse tehisneutraalpunkti, võib kokkuleppel kooste tootjaga olla vastuvõetav väiksem arvutuslik rikkevool ning väiksema läbimõõduga vasktraat (vt märkus 4), mille sulamisaeg on sama nagu märkuses 1.

source: NOTE 4 The relationship between the prospective fault current in the fusible element circuit and the diameter of the copper wire is given in Table 14.
et: MÄRKUS 4 Sulavelemendi ahela arvutusliku rikkevoolu ja vasktraadi läbimõõdu vahekord on esitatud tabelis 14.

source: 10.11.5.3 Testing of main circuits 10.11.5.3.1 General Circuits shall be tested with the highest thermal and dynamic stresses that may result from short-circuit currents up to the rated values for one or more of the following conditions as declared by the original manufacturer.
et: 10.11.5.3 Peaahelate katsetamine 10.11.5.3.1 Üldnõuded Ahelaid tuleb katsetada lühisvoolude tekitatava suurima soojusliku ja dünaamilise koormusega kuni tunnusväärtusteni, järgides seejuures üht või mitut alljärgnevat tingimust, nagu on deklareerinud esmatootja.

source: a) Not dependent upon a SCPD: the assembly shall be tested with the rated peak withstand current and the rated short-time withstand current for the specified duration (see 5.3 and 9.3.2 a)).
et: a) Sõltumatult lühisekaitseaparaadist: koostet tuleb katsetada tunnus-lööktaluvusvooluga ja sätestatud kestusega lühiajalise tunnus-taluvusvooluga (vt jaotis 5.3 ja jaotise 9.3.2 punkt a).

source: b) Dependent upon an incoming SCPD included within the assembly: the assembly shall be tested with an incoming prospective short-circuit current for a period of time that is limited by the incoming SCPD.
et: b) Sõltuvalt koostes, selle sisendahelas paiknevast lühisekaitseaparaadist: koostet tuleb katsetada sisendahela arvutusliku lühisvooluga lühisekaitseaparaadiga piiratud ajavahemikus.

source: c) Dependent upon an upstream SCPD: the assembly shall be tested to the let-through values permitted by the upstream SCPD as defined by the original manufacturer.
et: c) Sõltuvalt kooste toitepoolel paiknevast lühisekaitseaparaadist: koostet tuleb katsetada kuni toitepoolel paikneva välise lühisekaitseaparaadi lubatava läbilaskevooluni, nagu selle on määranud esmatootja.
